package com.maven.constant;

import com.maven.util.JSONUnit;

public enum Enum_MSG {

	/** --------返回接口错误-------- */
	失败(0,"失败"),
	成功(1,"成功"),
	系统错误(1001,"操作失败，请稍后尝试"),
	参数错误(1002,"参数错误"),
	逻辑事物异常(1003,"逻辑事物错误"),
	
	/** --------详细错误-------- */
	用户不存在(10000,"用户不存在"),
	金额异常(10001,"输入金额异常"),
	余额不足(10002,"账户余额不足"),
	非会员用户(10003,"非会员用户"),
	资金账户不存在(10004,"资金账户不存在"),
	用户身份异常(10005,"用户身份异常"),
	资金密码错误(10006,"资金密码错误"),
	登录密码错误(10007,"登录密码错误"),
	
	修改失败(10008,"参数错误,修改失败"),
	域名未注册(10009,"该域名未注册"),
	用户名已注册(10010,"用户名已存在"),
	银行卡已绑定(10011,"该银行卡已被绑定"),
	收款卡不存在(10012,"企业银行卡不存在"),
	取款卡不存在(10012,"用户银行卡不存在"),
	银行卡未锁定(10013,"银行卡未锁定"),
	银行卡未解锁(10013,"银行卡未解锁"),
	解密失败(10014,"解密失败"),
	域名已绑定(10015,"该域名已被占用,请使用其他域名"),
	数据异常(10016,"数据异常"),
	默认主域名禁止删除(10017,"默认主域名禁止删除"),
	未设置用户洗码(10018,"未设置用户洗码"),
	域名格式错误(10019,"域名格式错误"),
	游戏维护中(10020,"平台维护或升级中！请联系客服咨询"),
	用户名或密码错误(10021,"用户名或密码错误"),
	游戏API系统异常(10022,"游戏API系统异常"),
	账号或密码错误(10023,"账号或密码错误"),
	即时支付账号不存在(10024,"第三方即时支付账号不存在"),
	游戏类型错误(10025,"游戏类型错误"),
	企业API许可为空(10026,"未知的API许可"),
	域名已禁用(10027,"该域名已被禁用"),
	用户名长度不匹配(10028,"用户名长度需大于6位,小于12位"),
	银行卡长度不匹配(10029,"该银行卡需大于16位,小于19位"),
	提款次数已达上限(10030,"您每天的提款次数为{0}笔,今天的提款次数已达到上限"),
	提款金额已达上限(10031,"您每天的提款上限为{0}元,今天的提款金额已达到上限"),
	该品牌不存在(10032,"该品牌不存在"),
	参数类型不存在(10033,"{0}参数类型不存在"),
	用户未启用该游戏(10034,"未启用该游戏，请联系客服"),
	下分失败(10035,"下分失败"),
	暂不支持(10036,"暂不支持"),
	非代理用户(10037,"非代理用户"),
	开户名称不得包含数字(10038,"开户名称不得包含数字"),
	用户已禁用(10039,"账号已禁用"),
	账号尚未激活(100391,"账号尚未激活，请先激活！"),
	不得出现中文汉字或中文标点符号的全角字符(10040,"不得出现中文汉字或中文标点符号的全角字符"),
	只能按整数取款(10041,"为确保取款操作成功，只能按10的倍数取款[整数]，个位数必须是0"),
	信用代用户不得存取款(10050,"您是信用代用户，充值取款请联系您的上级代理！"),
	游戏密码同步中(10050,"游戏密码同步中"),
	短信验证码错误(10051,"短信验证码错误"),
	该手机号已注册过(10052,"该手机号已注册过"),
	元宝账户不存在(10053,"元宝账户不存在"),
	;
	
	private int code;
	public String desc;
	
    private Enum_MSG(int _code ,String _desc) {
    	this.code = _code;
    	this.desc = _desc;
    }
    public String message(String _code ,String _desc){
    	return "{\"code\":\""+_code +"\",\"info\":\""+ _desc +"\"}";
    }
    public String message(Object object){
    	if(object==null){
    		return "{\"code\":\""+this.code +"\",\"info\":\""+ this.desc +"\"}";
    	}else if(object instanceof String){
    		return "{\"code\":\""+this.code +"\",\"info\":\""+ object.toString() +"\"}";
    	}else{
    		return "{\"code\":\""+this.code +"\",\"info\":"+ JSONUnit.getJSONString(object)+"}";
    	}
    }
    
}
